package Inheritance;

public class Lion extends CatFamily{
    //когда мы создаем объект дочернего класса, то вызывается конструктор родительского класса без параметров
    //если в родительском классе не существует конструктора без параметроа, то необходимо вызвать тот конструктор, у которого есть параметры
    public Lion(){
        super(2,4,true);
    }

    //переопределение метода суперкласса (помечается как override)
    @Override
    public void eat() {
        System.out.println("antolipe");
    }
}
